
# 16. Дана послідовність натуральних чисел (одне число в рядку), що завершується числом 0. Визначте значення другого за величиною елемента 
# в цій послідовності, тобто елемента, який буде найбільшим, якщо з послідовності видалити найбільший елемент. У цьому завданні не можна 
# використовувати глобальні змінні. Функція отримує дані, зчитуючи їх з клавіатури, а не отримуючи їх у вигляді параметра. 
# У програмі на мові Python функція повертає результат у вигляді кортежу з кількох чисел і функція взагалі не отримує ніяких параметрів.
def check(a=(0,0),b=(0,0)):
    if a[0]<b[0]:
        if a[1] < a[0]:
         a=(a[0],a[0])
        a = (b[0], a[1])

    if a[1] < b[1]:
        a= (a[0], b[1])
    if a[1] < b[0] and a[1]<a[0]:
        a=(b[0],a[1])
    return a

def function():
 a1=int(input())
 if a1==0:
     return (0,0)
 a2=int(input())
 if a2==0:
     return(a1,a2)
 if a1>a2:
     a=(a1,a2)
     b = function()
     a = check(a, b)
     return a
 elif a1<=a2:
      a = (a2, a1)
      b = function()
      a = check(a, b)
      return a

print(function())
