# 2. Описати рекурсивную функцію Fact2 (N) дійсного типу, яка обчислює значення подвійного факторіала
# N !! = N • (N-2) • (N-4) • ... (N> 0 - параметр цілого типу; останній співмножник в творі дорівнює 2,
# якщо N - парне число, і 1, якщо N - непарне). За допомогою цієї функції обчислити подвійні факторіали
# п'яти довільних натуральних чисел.
def factorialTwo(n=int()):
    if n%2==0:
        if n>2:
         return n * factorialTwo(n - 2)
    else:
        if n>1:
         return n * factorialTwo(n - 2)
    return 1
print(factorialTwo(int(10)))